### Terraform `plan` Succeeded for Workspace: `default`
  
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_storage_blob.training_content_blobs["../web_content/404.html"] must be replaced
-/+ resource "azurerm_storage_blob" "training_content_blobs" {
!       access_tier            = "Hot" -> (known after apply)
!       content_md5            = "9228c65c39084ddd707582e1fa39db2e" -> "254f390d40a55e0f877f35b32c312c85" # forces replacement
!       id                     = "https://tamughtrnshem.blob.core.windows.net/$web/404.html" -> (known after apply)
!       metadata               = {} -> (known after apply)
        name                   = "404.html"
!       url                    = "https://tamughtrnshem.blob.core.windows.net/$web/404.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>
  